SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
/*!
 * \file      main_porting_tests.c
 *
 * \brief     main program for porting tests example
 *
 * The Clear BSD License
 * Copyright Semtech Corporation 2021. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the disclaimer
 * below) provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the Semtech corporation nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT
 * NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SEMTECH CORPORATION BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * -----------------------------------------------------------------------------
 * --- DEPENDENCIES ------------------------------------------------------------
 */
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>

#include "main_porting_tests.h"

#include "smtc_modem_api.h"
#include "smtc_modem_utilities.h"

#include "smtc_modem_hal.h"
#include "smtc_hal_trace.h"
#include "smtc_hal_dbg_trace.h"

//#include "example_options.h"

#include "smtc_hal_mcu.h"
#include "smtc_hal_gpio.h"
#include "smtc_hal_watchdog.h"

#include "em_cmu.h"

#if defined(SX128X)
#include "ralf_sx128x.h"
#elif defined(SX126X)
#include "ralf_sx126x.h"
#include "sx126x.h"
#elif defined(LR11XX)
#include "ralf_lr11xx.h"
#include "lr11xx_system.h"
#endif

#if defined (SL_CATALOG_KERNEL_PRESENT)
#include "cmsis_os2.h"
#endif

#include "sx126x_hal.h"
#include "sl_spidrv_instances.h"
#include "sl_power_manager.h"
#include "smtc_hal_spi.h"
/*******************************************************************************
 *******************************   DEFINES & TYPEDEF  ***********************************
 ******************************************************************************/
#define ENABLE_TEST_FLASH 0  // Enable flash porting test BUT disable other porting tests

#define BOARD_COMPENSATION_IN_MS 0

#define NB_LOOP_TEST_SPI 2
#define NB_LOOP_TEST_CONFIG_RADIO 2

#if defined(LR1110)
#define LR11XX_FW_VERSION 0x0401
#elif defined(LR1120)
#define LR11XX_FW_VERSION 0x0201
#elif defined(LR1121)
#define LR11XX_FW_VERSION 0x0103
#endif

#define FREQ_NO_RADIO 868300000
#define SYNC_WORD_NO_RADIO 0x21

#define XOSC_START_NB_ATTEMPTS 3
#define XOSC_START_SETTLE_MS 5

#define MARGIN_GET_TIME_IN_MS 1
#define MARGIN_TIMER_IRQ_IN_MS 2
#define MARGIN_TIME_CONFIG_RADIO_IN_MS 8
#define MARGIN_SLEEP_IN_MS 2

#define PORTING_TEST_MSG_OK( )                          \
  do                                                    \
  {                                                     \
    SMTC_HAL_TRACE_PRINTF(HAL_DBG_TRACE_COLOR_GREEN);   \
    SMTC_HAL_TRACE_PRINTF(" OK \n");                    \
    SMTC_HAL_TRACE_PRINTF(HAL_DBG_TRACE_COLOR_DEFAULT); \
  } while ( 0 )

#define PORTING_TEST_MSG_WARN(...)                      \
  do                                                    \
  {                                                     \
    SMTC_HAL_TRACE_PRINTF(HAL_DBG_TRACE_COLOR_YELLOW);  \
    SMTC_HAL_TRACE_PRINTF(__VA_ARGS__);                 \
    SMTC_HAL_TRACE_PRINTF(HAL_DBG_TRACE_COLOR_DEFAULT); \
  } while ( 0 )

#define PORTING_TEST_MSG_NOK(...)                       \
  do                                                    \
  {                                                     \
    SMTC_HAL_TRACE_PRINTF(HAL_DBG_TRACE_COLOR_RED);     \
    SMTC_HAL_TRACE_PRINTF("\n NOK:");                   \
    SMTC_HAL_TRACE_PRINTF(__VA_ARGS__);                 \
    SMTC_HAL_TRACE_PRINTF(HAL_DBG_TRACE_COLOR_DEFAULT); \
  } while ( 0 )

/*******************************************************************************
 ***************************  LOCAL VARIABLES   ********************************
 ******************************************************************************/
//#if defined( SX128X )
//const ralf_t modem_radio = RALF_SX128X_INSTANTIATE( NULL );
//#elif defined( SX126X )
//const ralf_t modem_radio = RALF_SX126X_INSTANTIATE( NULL );
//#elif defined( LR11XX )
//const ralf_t modem_radio = RALF_LR11XX_INSTANTIATE( NULL );
//#else
//#error "Please select radio board.."
//#endif
extern const ralf_t modem_radio;
typedef enum return_code_test_e{
  RC_PORTING_TEST_OK       = 0x00,    // Test OK
  RC_PORTING_TEST_NOK      = 0x01,    // Test NOK
  RC_PORTING_TEST_RELAUNCH = 0x02,    // Relaunch test
} return_code_test_t;

static volatile bool     radio_irq_raised      = false;
static volatile bool     irq_rx_timeout_raised = false;
static volatile bool     timer_irq_raised      = false;
static volatile uint32_t irq_time_ms           = 0;
static volatile uint32_t irq_time_s            = 0;

// LoRa configurations TO NOT receive or transmit
static ralf_params_lora_t rx_lora_param = { .sync_word                       = SYNC_WORD_NO_RADIO,
                                            .symb_nb_timeout                 = 0,
                                            .rf_freq_in_hz                   = FREQ_NO_RADIO,
                                            .mod_params.cr                   = RAL_LORA_CR_4_5,
                                            .mod_params.sf                   = RAL_LORA_SF12,
                                            .mod_params.bw                   = RAL_LORA_BW_125_KHZ,
                                            .mod_params.ldro                 = 0,
                                            .pkt_params.header_type          = RAL_LORA_PKT_EXPLICIT,
                                            .pkt_params.pld_len_in_bytes     = 255,
                                            .pkt_params.crc_is_on            = false,
                                            .pkt_params.invert_iq_is_on      = true,
                                            .pkt_params.preamble_len_in_symb = 8 };

static ralf_params_lora_t tx_lora_param = { .sync_word                       = SYNC_WORD_NO_RADIO,
                                            .symb_nb_timeout                 = 0,
                                            .rf_freq_in_hz                   = FREQ_NO_RADIO,
                                            .output_pwr_in_dbm               = 14,
                                            .mod_params.cr                   = RAL_LORA_CR_4_5,
                                            .mod_params.sf                   = RAL_LORA_SF12,
                                            .mod_params.bw                   = RAL_LORA_BW_125_KHZ,
                                            .mod_params.ldro                 = 0,
                                            .pkt_params.header_type          = RAL_LORA_PKT_EXPLICIT,
                                            .pkt_params.pld_len_in_bytes     = 50,
                                            .pkt_params.crc_is_on            = true,
                                            .pkt_params.invert_iq_is_on      = false,
                                            .pkt_params.preamble_len_in_symb = 8 };
#if (ENABLE_TEST_FLASH != 0)
static const char* name_context_type[] = { "MODEM", "KEY_MODEM", "LORAWAN_STACK",
                                           "FUOTA", "SECURE_ELEMENT", "STORE_AND_FORWARD" };
#endif

