SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
/*******************************************************************************
 *********************   LOCAL FUNCTION PROTOTYPES   ***************************
 ******************************************************************************/
static void radio_tx_irq_callback(void* obj);
static void radio_rx_irq_callback(void* obj);
static void radio_irq_callback_get_time_in_s(void* obj);
static void timer_irq_callback(void* obj);

static bool               reset_init_radio(void);
static return_code_test_t test_get_time_in_s(void);
static return_code_test_t test_get_time_in_ms(void);

static bool porting_test_spi(void);
static bool porting_test_osc(void);
static bool porting_test_radio_irq(void);
static bool porting_test_get_time(void);
static bool porting_test_timer_irq(void);
static bool porting_test_stop_timer(void);
static bool porting_test_disable_enable_irq(void);
static bool porting_test_random(void);
static bool porting_test_config_rx_radio(void);
static bool porting_test_config_tx_radio(void);
static bool porting_test_sleep_ms(void);
static bool porting_test_timer_irq_low_power(void);
#if (ENABLE_TEST_FLASH != 0)
static bool test_context_store_restore(modem_context_type_t context_type);
static bool porting_test_flash(void);
#endif
#ifdef SL_CATALOG_KERNEL_PRESENT
static void app_task(void *argument);
#endif
/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * Initialize main porting tests.
 ******************************************************************************/
void app_init(void)
{
#ifdef SL_CATALOG_KERNEL_PRESENT
  // CMSIS-RTOS v2 thread definition
  osThreadId_t app_task_id;
  (void)&app_task_id; // Unused variable
  static const osThreadAttr_t app_task_attr = {
    .name = "App Task",
    .stack_size = 2048,
    .priority = osPriorityNormal
  };

  // Initialize application task
  app_task_id = osThreadNew(app_task, NULL, &app_task_attr);
  if (app_task_id == NULL) {
    // Thread creation failed
    SMTC_HAL_TRACE_MSG("Failed to create app task\n");
    while (1) ;
  }
#endif
}

/***************************************************************************//**
 * Main porting tests process action.
 ******************************************************************************/
void app_process_action(void)
{
  bool ret = true;

  // Configure all the µC periph (clock, gpio, timer, ...)
  hal_mcu_init( );

  // Tests
  SMTC_HAL_TRACE_MSG("\n\n\nPORTING_TEST example is starting \n\n");

#if (ENABLE_TEST_FLASH == 0)

  ret = porting_test_spi( );
  if ( ret == false ) {
    return;
  }

  ret = porting_test_radio_irq( );
  if ( ret == false ) {
    porting_test_osc( );
    return;
  }

  ret = porting_test_get_time( );

  ret = porting_test_timer_irq( );
  if ( ret == false ) {
    return;
  }

  porting_test_stop_timer( );

  porting_test_disable_enable_irq( );

  smtc_modem_hal_reload_wdog();
  porting_test_random( );
  smtc_modem_hal_reload_wdog();

  porting_test_config_rx_radio( );

  porting_test_config_tx_radio( );

  porting_test_sleep_ms( );

  porting_test_timer_irq_low_power( );
#else
  ret = porting_test_flash( );
  if ( ret == false ) {
    return ret;
  }

  SMTC_HAL_TRACE_MSG_COLOR("\n MCU RESET => relaunch tests and check if read after reset = write before reset \n\n",
                           HAL_DBG_TRACE_COLOR_BLUE);

  hal_mcu_set_sleep_for_ms(2000);

  hal_mcu_reset( );

#endif
  SMTC_HAL_TRACE_MSG("----------------------------------------\nEND \n\n");

  while ( 1 ) {
    smtc_modem_hal_reload_wdog( );
  }

  return;
}

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DEFINITION --------------------------------------------
 */

/**
 * @brief Test SPI
 *
 * @remark
 * Prerequisite:
 * Radio reset should be implemented:
 * - drive of gpio (hal_gpio_set_value)
 * - mcu wait us (hal_mcu_wait_us)
 *
 * Test processing:
 * - Reset radio
 * - Read data through SPI
 * - Check if data is coherent
 *
 * Ported functions:
 * lr11xx_hal_read
 *      lr11xx_hal_check_device_ready
 *          lr11xx_hal_wait_on_busy
 *              hal_gpio_get_value
 *          hal_gpio_set_value
 *          hal_spi_in_out
 *
 * @return bool True if test is successful
 */
static bool porting_test_spi(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_spi : ");
  uint16_t counter_nok = 0;

  //Reset radio (prerequisite)
  ral_reset(&(modem_radio.ral) );
  for ( uint16_t i = 0; i < NB_LOOP_TEST_SPI; i++ ) {
#if defined(LR11XX)
    lr11xx_system_version_t version;
    lr11xx_status_t         status;

    status = lr11xx_system_get_version(NULL, &version);

    if ( status == LR11XX_STATUS_OK ) {
      if ( version.fw != LR11XX_FW_VERSION ) {
        PORTING_TEST_MSG_NOK(" Wrong LR11XX firmware version: expected 0x%04X / get 0x%04X \n",
                             LR11XX_FW_VERSION, version.fw);
        counter_nok++;
      }
    } else {
      PORTING_TEST_MSG_NOK(" Failed to get LR11XX firmware version \n");
      counter_nok++;
    }

#elif defined(SX126X)
    sx126x_chip_status_t chip_status;
    sx126x_status_t status;

    status = sx126x_get_status(NULL, &chip_status);
    if ( status == SX126X_STATUS_OK ) {
      if (chip_status.chip_mode == SX126X_CHIP_MODE_UNUSED) {
        PORTING_TEST_MSG_NOK("Wrong SX126X chip mode, get SX126X_CHIP_MODE_UNUSED \n");
        counter_nok++;
      }
    } else {
      PORTING_TEST_MSG_NOK("Failed to get SX126X status \n");
      counter_nok++;
    }
#else
    PORTING_TEST_MSG_NOK(" Radio is not supported \n");
    return false;
#endif
  }

  if (counter_nok == 0 ) {
    PORTING_TEST_MSG_OK();
  } else {
    PORTING_TEST_MSG_WARN(" Failed test = %u / %u \n", counter_nok, NB_LOOP_TEST_SPI);
    return false;
  }

