SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  return true;
}

/**
 * @brief Test LoRa chip oscillator initialization
 *
 * @remark
 * Prerequisite:
 * SPI communication with the radio must work (porting_test_spi).
 *
 * Test processing:
 * - Reset radio
 * - Call ral_init (BSP XOSC / TCXO setup, calibration when TCXO is radio-controlled)
 * - Request STBY_XOSC so the 32 MHz reference is started on purpose
 * - Check chip mode and XOSC start error flag
 *
 * Ported functions:
 * ral_init / ral_sx126x_init
 *     ral_sx126x_bsp_get_xosc_cfg
 *     sx126x_set_dio3_as_tcxo_ctrl
 *     sx126x_cal
 * sx126x_set_standby (STBY_XOSC)
 * sx126x_get_status
 * sx126x_get_device_errors
 *
 * @return bool True if test is successful
 */
static bool porting_test_osc(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_osc : ");

#if defined(SX126X)
  sx126x_chip_status_t chip_status = { 0 };
  sx126x_errors_mask_t errors      = { 0 };
  sx126x_status_t      status;

  ral_reset(&(modem_radio.ral) );

  if ( ral_init(&(modem_radio.ral) ) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_init() function failed (oscillator / tcxo setup) \n");
    return false;
  }

  for ( uint8_t attempt = 1; attempt <= XOSC_START_NB_ATTEMPTS; attempt++ ) {
    status = sx126x_clear_device_errors(NULL);
    if ( status == SX126X_STATUS_OK ) {
      status = sx126x_set_standby(NULL, SX126X_STANDBY_CFG_XOSC);
    }
    if ( status != SX126X_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" Failed to request STBY_XOSC \n");
      return false;
    }

    hal_mcu_wait_ms(XOSC_START_SETTLE_MS);

    status = sx126x_get_status(NULL, &chip_status);
    if ( status == SX126X_STATUS_OK ) {
      status = sx126x_get_device_errors(NULL, &errors);
    }
    if ( status != SX126X_STATUS_OK ) {
      PORTING_TEST_MSG_NOK(" Failed to read radio state after oscillator start \n");
      return false;
    }

    SMTC_HAL_TRACE_PRINTF(" [xosc attempt %u/%u] chip_mode = %u, errors = 0x%04X \n",
                          ( unsigned ) attempt, ( unsigned ) XOSC_START_NB_ATTEMPTS,
                          ( unsigned ) chip_status.chip_mode, ( unsigned ) errors);

    if ( (chip_status.chip_mode == SX126X_CHIP_MODE_STBY_XOSC)
         && ((errors & SX126X_ERRORS_XOSC_START) == 0) ) {
      PORTING_TEST_MSG_OK( );
      return true;
    }
  }

  PORTING_TEST_MSG_NOK(" Radio 32 MHz oscillator did not start: chip_mode = %u, errors = 0x%04X"
                       " (check TCXO/XTAL wiring and XOSC_CFG_TCXO_ENABLE) \n",
                       ( unsigned ) chip_status.chip_mode, ( unsigned ) errors);
  return false;

#elif defined(LR11XX)
  ral_reset(&(modem_radio.ral) );

  if ( ral_init(&(modem_radio.ral) ) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_init() function failed (oscillator / tcxo setup) \n");
    return false;
  }

  PORTING_TEST_MSG_OK( );
  return true;
#else
  PORTING_TEST_MSG_NOK(" Radio is not supported \n");
  return false;
#endif
}

/**
 * @brief Reset and init radio
 *
 * @remark
 * Test processing:
 * - Reset radio
 * - Init radio
 * - Set radio in sleep mode
 *
 * Ported functions:
 * ral_reset:
 * lr11xx_hal_reset
 *     hal_gpio_set_value
 *     hal_mcu_wait_us
 * ral_init:
 * ral_lr11xx_init
 *     ral_lr11xx_bsp_get_crc_state
 *     ral_lr11xx_bsp_get_reg_mode
 *     ral_lr11xx_bsp_get_rf_switch_cfg
 *     ral_lr11xx_bsp_get_xosc_cfg
 *     lr11xx_system_set_tcxo_mode
 *         lr11xx_hal_write
 *     lr11xx_system_calibrate
 *         lr11xx_hal_write
 * ral_set_sleep:
 * ral_lr11xx_set_sleep
 *     lr11xx_system_set_sleep
 *         lr11xx_hal_write
 *
 * @return bool True if test is successful
 */
static bool reset_init_radio(void)
{
  ral_status_t status = RAL_STATUS_ERROR;

  // Reset, init radio and put it in sleep mode
  ral_reset(&(modem_radio.ral) );

  status = ral_init(&(modem_radio.ral) );
  if ( status != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_init() function failed \n");
    return false;
  }

  status = ral_set_sleep(&(modem_radio.ral), true);
  smtc_modem_hal_set_ant_switch(false);
  if ( status != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_set_sleep() function failed \n");
    return false;
  }

  return true;
}

/**
 * @brief Test radio irq
 *
 * @remark
 * Test processing:
 * - Reset and init radio
 * - Configure radio irq
 * - Configure radio with bad parameters to receive a rx timeout irq
 * - Configure radio in reception mode with a timeout
 * - Wait
 * - Check if rx timeout irq is raised
 *
 * Ported functions:
 * smtc_modem_hal_irq_config_radio_irq:
 *     hal_gpio_irq_attach
 *
 * lr11xx_hal_write
 *     lr11xx_hal_check_device_ready
 *         lr11xx_hal_wait_on_busy
 *         hal_gpio_get_value
 *     hal_gpio_set_value
 *     hal_spi_in_out
 *     hal_gpio_set_value
 *     hal_mcu_wait_us
 *
 * @return bool True if test is successful
 */
static bool porting_test_radio_irq(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_radio_irq : ");

  bool     ret              = true;
  uint32_t rx_timeout_in_ms = 500;
  radio_irq_raised          = false;

  // Reset, init radio and put it in sleep mode
  ret = reset_init_radio( );
  if ( ret == false ) {
    return ret;
  }

  // Setup radio and relative irq
  smtc_modem_hal_irq_config_radio_irq(radio_rx_irq_callback, NULL);
  smtc_modem_hal_start_radio_tcxo( );
  smtc_modem_hal_set_ant_switch(false);
  if ( ralf_setup_lora(&modem_radio, &rx_lora_param) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ralf_setup_lora() function failed \n");
    return false;
  }
  if ( ral_set_dio_irq_params(&(modem_radio.ral), RAL_IRQ_RX_DONE | RAL_IRQ_RX_TIMEOUT | RAL_IRQ_RX_HDR_ERROR
                              | RAL_IRQ_RX_CRC_ERROR) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_set_dio_irq_params() function failed \n");
    return false;
  }

  // Configure radio in reception mode
  if ( ral_set_rx(&(modem_radio.ral), rx_timeout_in_ms) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK(" ral_set_rx() function failed \n");
    return false;
  }

