SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  // Wait 2 * timeout
  hal_mcu_wait_ms(rx_timeout_in_ms * 2);

  if ( radio_irq_raised == true ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_NOK(" Timeout, radio irq not received \n");
    return false;
  }
  return true;
}

/**
 * @brief Test get time in s
 *
 *
 * @remark
 *  Test processing:
 * - Reset, init and configure radio
 * - Configure radio in reception mode with a timeout
 * - Get start time
 * - Wait radio irq (get stop time in irq callback)
 * - Check if time is coherent with the configured timeout radio irq
 * Note: if radio irq received different of rx timeout irq -> relaunch test
 *
 * Ported functions:
 * smtc_modem_hal_get_time_in_s
 *      hal_rtc_get_time_s
 *
 * @return return_code_test_t   RC_PORTING_TEST_OK
 *                              RC_PORTING_TEST_NOK
 *                              RC_PORTING_TEST_RELAUNCH
 */
static return_code_test_t test_get_time_in_s(void)
{
  SMTC_HAL_TRACE_MSG(" * Get time in second: ");
  bool     ret              = true;
  uint32_t rx_timeout_in_ms = 5000;
  radio_irq_raised      = false;
  irq_rx_timeout_raised = false;
  rx_lora_param.symb_nb_timeout = 0;
  // Reset, init radio and put it in sleep mode
  ret = reset_init_radio( );
  if ( ret == false ) {
    return RC_PORTING_TEST_NOK;
  }

  // Setup radio and relative irq
  smtc_modem_hal_irq_config_radio_irq(radio_irq_callback_get_time_in_s, NULL);

  smtc_modem_hal_start_radio_tcxo( );
  smtc_modem_hal_set_ant_switch(false);
  if ( ralf_setup_lora(&modem_radio, &rx_lora_param) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ralf_setup_lora() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  if ( ral_set_dio_irq_params(&(modem_radio.ral), RAL_IRQ_RX_DONE | RAL_IRQ_RX_TIMEOUT | RAL_IRQ_RX_HDR_ERROR
                              | RAL_IRQ_RX_CRC_ERROR) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_set_dio_irq_params() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  // Configure radio in reception mode
  if ( ral_set_rx(&(modem_radio.ral), rx_timeout_in_ms) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_set_rx() function failed \n");
    return RC_PORTING_TEST_NOK;
  }
  uint32_t start_time_s = smtc_modem_hal_get_time_in_s( );
  while ( radio_irq_raised == false ) {
    // Do nothing
  }
  if ( irq_rx_timeout_raised == false ) {
    PORTING_TEST_MSG_WARN("\n Radio irq received but not RAL_IRQ_RX_TIMEOUT -> relaunched test \n ");
    return RC_PORTING_TEST_RELAUNCH;
  }
  uint32_t time = irq_time_s - start_time_s;
  if ( time  == (rx_timeout_in_ms / 1000) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF("Time expected %lus / get %lus (no margin)\n", (rx_timeout_in_ms / 1000), time);
  } else {
    PORTING_TEST_MSG_NOK("Time is not coherent: expected %lus / get %lus (no margin)\n",
                         (rx_timeout_in_ms / 1000), time);
    return RC_PORTING_TEST_NOK;
  }
  return RC_PORTING_TEST_OK;
}

/**
 * @brief Test get time in ms
 *
 *
 * @remark
 *  Test processing:
 * - Reset, init and configure radio (with a timeout symbol number)
 * - Get start time
 * - Configure radio in reception mode
 * - Wait radio irq (get stop time in irq callback)
 * - Check if time is coherent with the configured timeout symbol number
 * Note: if radio irq received different of rx timeout irq -> relaunch test
 *
 * Ported functions:
 * smtc_modem_hal_get_time_in_ms
 *      hal_rtc_get_time_ms
 *
 * @return return_code_test_t   RC_PORTING_TEST_OK
 *                              RC_PORTING_TEST_NOK
 *                              RC_PORTING_TEST_RELAUNCH
 */
static return_code_test_t test_get_time_in_ms(void)
{
  SMTC_HAL_TRACE_MSG(" * Get time in millisecond: ");

  bool ret              = true;
  radio_irq_raised      = false;
  irq_rx_timeout_raised = false;
  uint8_t wait_start_ms = 5;

  // To avoid misalignment between symb timeout and real timeout for all radio, a number of symbols smaller than 63 is
  // to be used.
  rx_lora_param.symb_nb_timeout = 62;
  rx_lora_param.mod_params.sf   = RAL_LORA_SF12;
  rx_lora_param.mod_params.bw   = RAL_LORA_BW_125_KHZ;

  // Warning: to be updated if previous parameters (SF and BW) are changed
  uint32_t symb_time_ms =
    ( uint32_t ) (rx_lora_param.symb_nb_timeout * ( (1 << 12) / 125.0) );          // 2^(SF) / BW * symb_nb_timeout

  // Reset, init radio and put it in sleep mode
  ret = reset_init_radio( );
  if ( ret == false ) {
    return RC_PORTING_TEST_NOK;
  }

  // Setup radio and relative irq
  smtc_modem_hal_irq_config_radio_irq(radio_rx_irq_callback, NULL);

  smtc_modem_hal_start_radio_tcxo( );
  smtc_modem_hal_set_ant_switch(false);
  if ( ralf_setup_lora(&modem_radio, &rx_lora_param) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ralf_setup_lora() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  if ( ral_set_dio_irq_params(&(modem_radio.ral), RAL_IRQ_RX_DONE | RAL_IRQ_RX_TIMEOUT | RAL_IRQ_RX_HDR_ERROR
                              | RAL_IRQ_RX_CRC_ERROR) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_set_dio_irq_params() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  // Wait 5ms to start
  uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( ) + wait_start_ms;
  while ( smtc_modem_hal_get_time_in_ms( ) < start_time_ms ) {
    // Do nothing
  }

  if ( ral_set_rx(&(modem_radio.ral), 0) != RAL_STATUS_OK ) {
    PORTING_TEST_MSG_NOK("ral_set_rx() function failed \n");
    return RC_PORTING_TEST_NOK;
  }

  while ( radio_irq_raised == false ) {
    // Do nothing
  }

  if ( irq_rx_timeout_raised == false ) {
    PORTING_TEST_MSG_WARN("\n Radio irq received but not RAL_IRQ_RX_TIMEOUT -> relaunched test \n ");
    return RC_PORTING_TEST_RELAUNCH;
  }

  uint32_t time = irq_time_ms - start_time_ms;
  if (abs(time - symb_time_ms) <= MARGIN_GET_TIME_IN_MS ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF(" Time expected %lums / get %lums (margin +/-%ums) \n", ( uint32_t ) symb_time_ms, time,
                          MARGIN_GET_TIME_IN_MS);
  } else {
    PORTING_TEST_MSG_NOK(" Time is not coherent with radio irq : expected %lums / get %lums (margin +/-%ums) \n",
                         ( uint32_t ) symb_time_ms, time, MARGIN_GET_TIME_IN_MS);
    return RC_PORTING_TEST_NOK;
  }
  return RC_PORTING_TEST_OK;
}

/**
 * @brief Test time (Get time in s and in ms)
 *
 * @remark See test_get_time_in_s() and test_get_time_in_ms() functions
 *
 * @return bool True if test is successful
 */
static bool porting_test_get_time(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_get_time : \n");

  return_code_test_t ret = RC_PORTING_TEST_OK;

  do {
    ret = test_get_time_in_s( );
    if ( ret == RC_PORTING_TEST_NOK ) {
      return false;
    }
  } while ( ret == RC_PORTING_TEST_RELAUNCH );

  do {
    ret = test_get_time_in_ms( );
    if ( ret == RC_PORTING_TEST_NOK ) {
      return false;
    }
  } while ( ret == RC_PORTING_TEST_RELAUNCH );

