SiliconLabsSoftware/devs-refd-lorawan/lbm_applications/4_porting_efr32/main_examples/main_porting_tests.c
  return true;
}

/**
 * @brief Test timer IRQ
 *
 * @warning smtc_modem_hal_start_timer() function takes ~4ms for STM32L4 (see HAL_LPTIM_TimeOut_Start_IT())
 *
 * @remark
 * Test processing:
 * - Get start time
 * - Configure and start timer
 * - Wait timer irq (get stop time in irq callback)
 * - Check the time elapsed between timer start and timer IRQ reception
 *
 * Ported functions:
 * smtc_modem_hal_start_timer
 *      hal_lp_timer_start
 *
 * @return bool True if test is successful
 */
static bool porting_test_timer_irq(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_timer_irq : ");

  uint32_t timer_ms      = 3000;
  uint8_t  wait_start_ms = 5;
  uint16_t timeout_ms    = 2000;
  timer_irq_raised       = false;

  smtc_modem_hal_stop_timer( );

  // Wait 5ms to start
  uint32_t start_time_ms = smtc_modem_hal_get_time_in_ms( ) + wait_start_ms;

  while ( smtc_modem_hal_get_time_in_ms( ) < start_time_ms ) {
    // Do nothing
  }

  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback,
                             NULL);

  // Timeout if irq not raised
  while ( (timer_irq_raised == false)
          && ( (smtc_modem_hal_get_time_in_ms( ) - start_time_ms) < (timer_ms + timeout_ms) ) ) {
    // Do nothing
  }

  if ( timer_irq_raised == false ) {
    PORTING_TEST_MSG_NOK(" Timeout: timer irq not received \n");
    return false;
  }

  uint32_t time = irq_time_ms - start_time_ms - BOARD_COMPENSATION_IN_MS;

  if ( (time >= timer_ms) && (time <= timer_ms + MARGIN_TIMER_IRQ_IN_MS) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF("Timer irq configured with %lums / get %lums (margin +%ums) \n", timer_ms, time,
                          MARGIN_TIMER_IRQ_IN_MS);
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq delay is not coherent: expected %lums / get %lums (margin +%ums) \n", timer_ms,
                         time, MARGIN_TIMER_IRQ_IN_MS);
    return false;
  }
  return true;
}

/**
 * @brief Test stop timer
 *
 * @remark
 * Test processing:
 * - Configure and start timer
 * - Wait
 * - Stop timer
 * - Wait the end of timer
 * - Check if timer IRQ is not received
 *
 * Ported functions:
 * smtc_modem_hal_stop_timer
 *      hal_lp_timer_stop
 *
 * @return bool True if test is successful
 */
static bool porting_test_stop_timer(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_stop_timer : ");

  uint32_t timer_ms = 1000;
  timer_irq_raised  = false;

  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback, NULL);

  // Wait half of timer
  uint32_t time = smtc_modem_hal_get_time_in_ms( );
  while ( (smtc_modem_hal_get_time_in_ms( ) - time) < (timer_ms / 2) ) {
    // Do nothing
  }

  smtc_modem_hal_stop_timer( );

  // Wait a little more than the end of timer
  time = smtc_modem_hal_get_time_in_ms( );
  while ( (smtc_modem_hal_get_time_in_ms( ) - time) < (timer_ms + 500) ) {
    // Do nothing
  }

  if ( timer_irq_raised == false ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq raised while timer is stopped \n");
    return false;
  }
  return true;
}

/**
 * @brief Test enable/disable irq
 *
 * @remark
 * Test processing:
 * - Disable irq
 * - Start timer with irq
 * - Wait the end of timer
 * - Check if timer irq is not raised
 * - Enable irq
 * - Check if timer irq is raised
 *
 * Ported functions:
 * smtc_modem_hal_disable_modem_irq
 * smtc_modem_hal_enable_modem_irq
 *
 * @return bool True if test is successful
 */
static bool porting_test_disable_enable_irq(void)
{
  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_disable_enable_irq : ");

  uint32_t timer_ms = 3000;
  timer_irq_raised  = false;

  smtc_modem_hal_disable_modem_irq( );
  smtc_modem_hal_start_timer(timer_ms, timer_irq_callback, NULL);

  // Wait a little more than the end of timer
  uint32_t time = smtc_modem_hal_get_time_in_ms( );
  while ( (smtc_modem_hal_get_time_in_ms( ) - time) < (timer_ms + 1000) ) {
    // Do nothing
  }

  if ( timer_irq_raised == true ) {
    PORTING_TEST_MSG_NOK("Timer irq raised while irq is disabled\n");
    return false;
  }

  smtc_modem_hal_enable_modem_irq();

  if ( timer_irq_raised == true ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_NOK(" Timer irq not received while irq is re-enabled \n");
    return false;
  }

  return true;
}

/**
 * @brief Test get random numbers
 *
 * @remark
 * Test processing:
 * 1) - Get 2 random numbers in full range
 * - Check if numbers are not equals to 0 and are different
 * 2) - Get 2 random numbers in a defined range
 * - Check if numbers are different and in the defined range
 * 3) - Get random draw of numbers between in a defined range
 * - Check if draw of each value is equivalent
 *
 * Ported functions:
 * smtc_modem_hal_get_random_nb_in_range
 *      hal_rng_get_random_in_range
 *
 * @return bool True if test is successful
 */
static bool porting_test_random(void)
{
  bool ret = true;

  SMTC_HAL_TRACE_MSG("----------------------------------------\n porting_test_random : \n");

  SMTC_HAL_TRACE_MSG(" * Get random nb : ");
  uint32_t rdom1 = smtc_modem_hal_get_random_nb_in_range(0, 0xFFFFFFFF);
  uint32_t rdom2 = smtc_modem_hal_get_random_nb_in_range(0, 0xFFFFFFFF);

  if ( (rdom1 != 0) && (rdom2 != 0) && (rdom1 != rdom2) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF(" random1 = %lu, random2 = %lu\n", rdom1, rdom2);
  } else {
    PORTING_TEST_MSG_WARN("\n => random1 = %lu, random2 = %lu\n", rdom1, rdom2);
    ret = false;
  }

  SMTC_HAL_TRACE_MSG(" * Get random nb in range : ");
  uint32_t range_min = 1;
  uint32_t range_max = 42;

  rdom1 = smtc_modem_hal_get_random_nb_in_range(range_min, range_max);
  rdom2 = smtc_modem_hal_get_random_nb_in_range(range_min, range_max);

  if ( (rdom1 >= range_min) && (rdom1 <= range_max) && (rdom2 >= range_min) && (rdom2 <= range_max)
       && (rdom1 != rdom2) ) {
    PORTING_TEST_MSG_OK( );
    SMTC_HAL_TRACE_PRINTF(" random1 = %lu, random2 = %lu in range [%lu;%lu]\n", rdom1, rdom2, range_min, range_max);
  } else {
    PORTING_TEST_MSG_WARN("\n => random1 = %lu, random2 = %lu, expected range [%lu;%lu]\n", rdom1, rdom2, range_min,
                          range_max);
    ret = false;
  }

  SMTC_HAL_TRACE_MSG(" * Get random draw : ");
  range_min                       = 1;
  range_max                       = 10;
  uint32_t tab_counter_random[10] = { 0 };
#ifdef SL_CATALOG_KERNEL_PRESENT
  uint32_t nb_draw                = 50000; // Reduced to limit the blocking time in RTOS
#else
  uint32_t nb_draw                = 100000;
#endif
  uint32_t probability_draw       = nb_draw / (range_max - range_min + 1);
  // Warning to be update if probability_draw is changed
  int16_t margin = (probability_draw * 5) / 100;      // error margin = 5% of probability_draw

  for ( uint32_t i = 0; i < nb_draw; i++ ) {
    rdom1 = smtc_modem_hal_get_random_nb_in_range(range_min, range_max);
    tab_counter_random[rdom1 - 1]++;
  }

  uint8_t tab_size = sizeof(tab_counter_random) / sizeof(uint32_t);
  for ( uint16_t i = 0; i < tab_size; i++ ) {
    if ( abs(probability_draw - tab_counter_random[i]) > margin ) {
      PORTING_TEST_MSG_WARN("\n => The number %u has been drawned %lu times, Expected [%lu;%lu] times \n",
                            (i + 1), tab_counter_random[i], (probability_draw - margin),
                            (probability_draw + margin) );
      ret = false;
    }
  }

  if ( ret == true ) {
    PORTING_TEST_MSG_OK( );
  } else {
    PORTING_TEST_MSG_WARN(" TODO Warning smtc_modem_hal_get_random_nb_in_range error margin > 5%% \n");
  }

